/***************************************************

		file
				ハイスコア用テキスト読み取り


****************************************************/



//=============================================================================
//	ファイル処理関係の自作関数群
//=============================================================================
#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
#include "debug_font.h"

//-----------------------------------------------------------------------------
// グローバル変数
//-----------------------------------------------------------------------------
static char FileName[] = "HiScore.txt";	// ハイスコアを格納するファイル名

int HighScore = 0;

//-----------------------------------------------------------------------------
// 関数名　：　HighScore_Load()　
// 機能概要：　ハイスコアを読み込む
//-----------------------------------------------------------------------------
int HighScore_Load(void)
{
	FILE *fp;

	if ((fp = fopen(FileName, "r")) == NULL)
		HighScore = 0;
	else
	{
		fscanf(fp, "%d", &HighScore);
		fclose(fp);
	}

	return (HighScore);

}

//-----------------------------------------------------------------------------
// 関数名　：　HighScore_Save()　
// 機能概要：　ハイスコアを保存する
//-----------------------------------------------------------------------------
void HighScore_Save(int NewScore)
{
	FILE *fp;
	char mes[80];

	if ((fp = fopen(FileName, "w")) == NULL)
	{
		DebugFont_Draw(200, 200, "ファイルオープンに失敗しました");
		return;
	}

	fprintf(fp, "%d", NewScore);
	fclose(fp);

}

int GetHighScore()
{
	return HighScore;
}